stm32-hotspot/STM32WBA-BLE-Enhanced-ATT/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_App_EATT_central/STM32_WPAN/App/gatt_client_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    gatt_client_app.c
  * @author  MCD Application Team
  * @brief   GATT Client Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/

#include "main.h"
#include "log_module.h"
#include "app_common.h"
#include "dbg_trace.h"
#include "ble.h"
#include "gatt_client_app.h"
#include "stm32_seq.h"
#include "app_ble.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32_timer.h"
#include "stm32wbaxx_nucleo.h"
#include "host_stack_if.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

/* USER CODE BEGIN PTD */


typedef struct
{
  /**
   * ID of the Write timeout
   */
//  UTIL_TIMER_Object_t TimerDataThroughput_Id;
  UTIL_TIMER_Object_t TimerDataThroughput_Update_Bearer1_Id;
  UTIL_TIMER_Object_t TimerDataThroughput_Update_Bearer2_Id;
  /* USER CODE END Service1_APP_Context_t */
  uint16_t              ConnectionHandle;
} EATT_CLI_APP_Context_t;
/* USER CODE END PTD */

typedef enum
{
  NOTIFICATION_INFO_RECEIVED_EVT,
  /* USER CODE BEGIN GATT_CLIENT_APP_Opcode_t */
  NOTIFICATION_BEARER1_SVC1_CHAR1_UPDATE_EVT,
  NOTIFICATION_BEARER2_SVC1_CHAR1_UPDATE_EVT,
  /* USER CODE END GATT_CLIENT_APP_Opcode_t */
}GATT_CLIENT_APP_Opcode_t;

typedef struct
{
  uint8_t *p_Payload;
  uint8_t length;
}GATT_CLIENT_APP_Data_t;

typedef struct
{
  GATT_CLIENT_APP_Opcode_t Client_Evt_Opcode;
  GATT_CLIENT_APP_Data_t   DataTransfered;
}GATT_CLIENT_APP_Notification_evt_t;

typedef struct
{
  EATTC_STM_Payload_t TxData;
  EATTC_App_Transfer_Req_Status_t NotificationTransferReq;
  EATTC_App_Transfer_Req_Status_t ButtonTransferReq;
  EATTC_App_Flow_Status_t DtFlowStatus;
  uint8_t connectionstatus;
} EATTC_Context_t;

typedef struct
{
  EATTC_STM_Payload_t     DataTransfered;
  uint16_t                ConnectionHandle;
  uint8_t                 ServiceInstance;

  /* USER CODE BEGIN Service1_NotificationEvt_t */
  GATT_CLIENT_APP_Opcode_t       EvtOpcode;
  /* USER CODE END Service1_NotificationEvt_t */

} EATT_CLI_NotificationEvt_t;

typedef struct
{
  GATT_CLIENT_APP_State_t state;

  APP_BLE_ConnStatus_t connStatus;
  uint16_t connHdl;

  uint16_t ALLServiceStartHdl;
  uint16_t ALLServiceEndHdl;

  uint16_t GAPServiceStartHdl;
  uint16_t GAPServiceEndHdl;

  uint16_t GATTServiceStartHdl;
  uint16_t GATTServiceEndHdl;

  uint16_t ServiceChangedCharStartHdl;
  uint16_t ServiceChangedCharValueHdl;
  uint16_t ServiceChangedCharDescHdl;
  uint16_t ServiceChangedCharEndHdl;
  uint8_t ServiceChangedCharProperties;
  /* EATT bearer */
  uint16_t EATT_Bearer_connHdl[6];
  /* handles of the P2P service */
  uint16_t EATTServiceHdl;
  uint16_t EATTServiceEndHdl;

  /* handles of the Tx characteristic - Write To Server */
  uint16_t EATTChar1CharHdl;
  uint16_t EATTChar1ValueHdl;
  uint16_t EATTChar1DescHdl;

  /* handles of the Rx characteristic - Notification From Server */
  uint16_t EATTChar2CharHdl;
  uint16_t EATTChar2ValueHdl;
  uint16_t EATTChar2DescHdl;
  uint16_t MTUSizeValue;

  /* USER CODE BEGIN BleClientAppContext_t */

/* USER CODE END BleClientAppContext_t */

}BleClientAppContext_t;

/* Private defines ------------------------------------------------------------*/
#define GATT_EAB_PREFIX                         0xEAU

/* USER CODE BEGIN PD */
#define EATT_SERVICE_UUID (0xAAAA)
#define EATT_CHAR1_CHAR_UUID (0x1111)
#define EATT_CHAR2_CHAR_UUID (0x2222)

#define DELAY_1S (1000)
#define TIMEUNIT  1
/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
#define UNPACK_2_BYTE_PARAMETER(ptr)  \
        (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
        (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

static BleClientAppContext_t a_ClientContext[BLE_CFG_CLT_MAX_NBR_CB];
static uint16_t gattCharStartHdl = 0;
static uint16_t gattCharValueHdl = 0;

/* USER CODE BEGIN PV */
EATTC_Context_t EATTC_Context;
uint8_t Notification_Data_Buffer1[DATA_NOTIFICATION_MAX_PACKET_SIZE];
uint8_t Notification_Data_Buffer2[DATA_NOTIFICATION_MAX_PACKET_SIZE];
static EATT_CLI_NotificationEvt_t NotificationData1;
static EATT_CLI_NotificationEvt_t NotificationData2;
//static uint8_t g_Notification1_n_1 = 0;
//static uint8_t g_Notification2_n_1 = 0;
static uint16_t packet_lost;
static uint32_t DataThroughputValue1;
static uint32_t DataThroughputValue2;
static uint32_t packet_lost_local;
//static void DataT_Notification_Data( void );
static void DataT_Notification_Data_Bearer1( void );
static void DataT_Notification_Data_Bearer2( void );
uint32_t dtc_n=0;
uint32_t DataTransfered1 = 0;
uint32_t DataTransfered2 = 0;
EATT_CLI_APP_Context_t EATT_CLI_APP_Context;
static uint16_t EATT_Bearer_connHdl;
/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/
/* USER CODE BEGIN GV */
extern BleCoC_EATTContext_t BleCoC_EATTContextCentral;
/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/
static SVCCTL_EvtAckStatus_t Event_Handler(void *Event);
static void gatt_parse_services(aci_att_read_by_group_type_resp_event_rp0 *p_evt);
static void gatt_parse_services_by_UUID(aci_att_find_by_type_value_resp_event_rp0 *p_evt);
static void gatt_parse_chars(aci_att_read_by_type_resp_event_rp0 *p_evt);
static void gatt_parse_descs(aci_att_find_info_resp_event_rp0 *p_evt);
static void gatt_parse_notification(aci_gatt_notification_event_rp0 *p_evt);
static void gatt_Notification(GATT_CLIENT_APP_Notification_evt_t *p_Notif);
static void client_discover_all(void);
static void gatt_cmd_resp_release(void);
static void gatt_cmd_resp_wait(void);
/* USER CODE BEGIN PFP */
static void SendDataWrite1( void );
static void Resume_Write1( void );
static void SendDataWrite2( void );
static void Resume_Write2( void );
static void DataThroughputNotif_Bearer1_proc(void *arg);
static void DataThroughputNotif_Bearer2_proc(void *arg);
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief  Service initialization
 * @param  None
 * @retval None
 */
void GATT_CLIENT_APP_Init(void)
{
  uint8_t index =0;
  /* USER CODE BEGIN GATT_CLIENT_APP_Init_1 */
  uint8_t i;
  /* USER CODE END GATT_CLIENT_APP_Init_1 */
  for(index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
  {
    a_ClientContext[index].connStatus = APP_BLE_IDLE;
  }

  /* Register the event handler to the BLE controller */
  SVCCTL_RegisterCltHandler(Event_Handler);

  /* Register a task allowing to discover all services and characteristics and enable all notifications */
  UTIL_SEQ_RegTask(1U << CFG_TASK_DISCOVER_SERVICES_ID, UTIL_SEQ_RFU, client_discover_all);

  /* USER CODE BEGIN GATT_CLIENT_APP_Init_2 */
  
   UTIL_TIMER_Create(&(EATT_CLI_APP_Context.TimerDataThroughput_Update_Bearer1_Id),
                    0,
                    (UTIL_TIMER_Mode_t)UTIL_TIMER_ONESHOT,
                    &DataThroughputNotif_Bearer1_proc, 
                    0);
  
  UTIL_TIMER_SetPeriod(&(EATT_CLI_APP_Context.TimerDataThroughput_Update_Bearer1_Id), DELAY_1S);
  
  UTIL_TIMER_Create(&(EATT_CLI_APP_Context.TimerDataThroughput_Update_Bearer2_Id),
                    0,
                    (UTIL_TIMER_Mode_t)UTIL_TIMER_ONESHOT,
                    &DataThroughputNotif_Bearer2_proc, 
                    0);
  
  UTIL_TIMER_SetPeriod(&(EATT_CLI_APP_Context.TimerDataThroughput_Update_Bearer2_Id), DELAY_1S);
  
  UTIL_SEQ_RegTask(1U << CFG_TASK_DATA_FROM_SERVER_BEARER1_ID, UTIL_SEQ_RFU, DataT_Notification_Data_Bearer1); 
  
  UTIL_SEQ_RegTask(1U << CFG_TASK_DATA_FROM_SERVER_BEARER2_ID, UTIL_SEQ_RFU, DataT_Notification_Data_Bearer2); 
  
  UTIL_SEQ_RegTask(1U << CFG_TASK_WRITE_DATA_BEARER1_ID, UTIL_SEQ_RFU, SendDataWrite1);
  
