stm32-hotspot/STM32WBA-BLE-Enhanced-ATT/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_App_EATT_central/STM32_WPAN/App/gatt_client_app.c
static void gatt_parse_notification(aci_gatt_notification_event_rp0 *p_evt)
{
  LOG_DEBUG_APP("ACI_GATT_NOTIFICATION_VSEVT_CODE - ConnHdl=0x%04X, Attribute_Handle=0x%04X\n",
                p_evt->Connection_Handle,
                p_evt->Attribute_Handle);
/* USER CODE BEGIN gatt_parse_notification_1 */
  uint8_t CRC_Result;
  uint8_t CRC_Received;
  a_ClientContext[0].MTUSizeValue = 241;
  
  if ((p_evt->Attribute_Handle == a_ClientContext[0].EATTChar1ValueHdl) && 
      (p_evt->Attribute_Value_Length > (2)))
  {
    if (p_evt->Connection_Handle == 0xEA00)
    {
      NotificationData1.EvtOpcode = NOTIFICATION_BEARER1_SVC1_CHAR1_UPDATE_EVT;
      NotificationData1.DataTransfered.Length = p_evt->Attribute_Value_Length;
      NotificationData1.DataTransfered.pPayload = (p_evt->Attribute_Value);
      NotificationData1.DataTransfered.pPayload_n = *((uint32_t*) &(p_evt->Attribute_Value[0]));
      
      __disable_irq();
      if (NotificationData1.DataTransfered.pPayload_n >= (NotificationData1.DataTransfered.pPayload_n_1 + 2))
      {
        packet_lost +=
          ((NotificationData1.DataTransfered.pPayload_n - NotificationData1.DataTransfered.pPayload_n_1) - 1);
      }
      __enable_irq();
      /* CRC computation */
      CRC_Result = APP_BLE_ComputeCRC8((uint8_t*) (p_evt->Attribute_Value), (p_evt->Attribute_Value_Length) - 1);
      /* get low weight byte */
      CRC_Received = (uint8_t) (p_evt->Attribute_Value[a_ClientContext[0].MTUSizeValue - 1]);
      
      if (CRC_Received != CRC_Result)
      {
        dtc_n += 1;
        LOG_INFO_APP("** data error **  N= %d \r\n",(int32_t)dtc_n);
      }
      NotificationData1.DataTransfered.pPayload_n_1 = NotificationData1.DataTransfered.pPayload_n; 
      
      if (DataTransfered1 == 0)
      {
        UTIL_TIMER_Start(&(EATT_CLI_APP_Context.TimerDataThroughput_Update_Bearer1_Id));
      }
      DataTransfered1 += NotificationData1.DataTransfered.Length;
    }
    if (p_evt->Connection_Handle == 0xEA01)
    {
      NotificationData2.EvtOpcode = NOTIFICATION_BEARER1_SVC1_CHAR1_UPDATE_EVT;
      NotificationData2.DataTransfered.Length = p_evt->Attribute_Value_Length;
      NotificationData2.DataTransfered.pPayload = (p_evt->Attribute_Value);
      NotificationData2.DataTransfered.pPayload_n = *((uint32_t*) &(p_evt->Attribute_Value[0]));
      
      __disable_irq();
      if (NotificationData2.DataTransfered.pPayload_n >= (NotificationData2.DataTransfered.pPayload_n_1 + 2))
      {
        packet_lost +=
          ((NotificationData2.DataTransfered.pPayload_n - NotificationData2.DataTransfered.pPayload_n_1) - 1);
      }
      __enable_irq();
      /* CRC computation */
      CRC_Result = APP_BLE_ComputeCRC8((uint8_t*) (p_evt->Attribute_Value), (p_evt->Attribute_Value_Length) - 1);
      /* get low weight byte */
      CRC_Received = (uint8_t) (p_evt->Attribute_Value[a_ClientContext[0].MTUSizeValue - 1]);
      
      if (CRC_Received != CRC_Result)
      {
        dtc_n += 1;
        LOG_INFO_APP("** data error **  N= %d \r\n",(int32_t)dtc_n);
      }
      NotificationData2.DataTransfered.pPayload_n_1 = NotificationData2.DataTransfered.pPayload_n;

      if (DataTransfered2 == 0)
      {
        UTIL_TIMER_Start(&(EATT_CLI_APP_Context.TimerDataThroughput_Update_Bearer2_Id));
      }
      DataTransfered2 += NotificationData2.DataTransfered.Length;
    }
    
  }
  
/* USER CODE END gatt_parse_notification_1 */

  return;
}

static void client_discover_all(void)
{
  uint8_t index = 0;
  /* USER CODE BEGIN client_discover_1 */

  /* USER CODE END client_discover_1 */

  GATT_CLIENT_APP_Discover_services(index);

  /* USER CODE BEGIN client_discover_2 */

  /* USER CODE END client_discover_2 */
  return;
}

static void gatt_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

static void gatt_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

/* USER CODE BEGIN LF */

static void SendDataWrite1( void )
{
  tBleStatus status = BLE_STATUS_INVALID_PARAMS;
  uint8_t crc_result;

  if( (EATTC_Context.ButtonTransferReq != EATTC_APP_TRANSFER_REQ_OFF) && 
      (EATTC_Context.DtFlowStatus != EATTC_APP_FLOW_OFF) )
  {   
    /*Data Packet to send to remote*/
    Notification_Data_Buffer1[0] += 1;
    a_ClientContext[0].MTUSizeValue = 241;
    /* compute CRC */
    crc_result = APP_BLE_ComputeCRC8((uint8_t*) Notification_Data_Buffer1, (a_ClientContext[0].MTUSizeValue - 1));
    Notification_Data_Buffer1[a_ClientContext[0].MTUSizeValue - 1] = crc_result;

    EATTC_Context.TxData.pPayload = Notification_Data_Buffer1;
    EATTC_Context.TxData.Length =  241; //a_ClientContext[0].MTUSizeValue;
    
    EATT_Bearer_connHdl = a_ClientContext[0].EATT_Bearer_connHdl[0];
    
    status = aci_gatt_write_without_resp( EATT_Bearer_connHdl,
                                         a_ClientContext[0].EATTChar1ValueHdl,
                                         241, //a_ClientContext[0].MTUSizeValue,
                                         (const uint8_t*)(EATTC_Context.TxData.pPayload));
    
    if (status == BLE_STATUS_INSUFFICIENT_RESOURCES)
    {
      EATTC_Context.DtFlowStatus = EATTC_APP_FLOW_OFF;
      (Notification_Data_Buffer1[0])-=1;
    }
    else
    {
      UTIL_SEQ_SetTask(1U << CFG_TASK_BLE_HOST, CFG_SEQ_PRIO_0);
      UTIL_SEQ_SetTask(1U << CFG_TASK_WRITE_DATA_BEARER1_ID, CFG_SEQ_PRIO_0);
    }
  }
  BleStackCB_Process();

  return;
}

static void SendDataWrite2( void )
{
  tBleStatus status = BLE_STATUS_INVALID_PARAMS;
  uint8_t crc_result;

  if( (EATTC_Context.ButtonTransferReq != EATTC_APP_TRANSFER_REQ_OFF) && 
      (EATTC_Context.DtFlowStatus != EATTC_APP_FLOW_OFF) )
  {   
    /*Data Packet to send to remote*/
    Notification_Data_Buffer2[0] += 1;
    a_ClientContext[0].MTUSizeValue = 241;
    /* compute CRC */
    crc_result = APP_BLE_ComputeCRC8((uint8_t*) Notification_Data_Buffer2, (a_ClientContext[0].MTUSizeValue - 1));
    Notification_Data_Buffer2[a_ClientContext[0].MTUSizeValue - 1] = crc_result;

    EATTC_Context.TxData.pPayload = Notification_Data_Buffer2;
    EATTC_Context.TxData.Length =  a_ClientContext[0].MTUSizeValue;
    
