stm32-hotspot/STM32WBA-BLE-Enhanced-ATT/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_App_EATT_central/STM32_WPAN/App/gatt_client_app.c
    EATT_Bearer_connHdl = a_ClientContext[0].EATT_Bearer_connHdl[1];

    status = aci_gatt_write_without_resp(EATT_Bearer_connHdl,
                                         a_ClientContext[0].EATTChar1ValueHdl,
                                         241, //a_ClientContext[0].MTUSizeValue,
                                         (const uint8_t*)(EATTC_Context.TxData.pPayload));

    if (status == BLE_STATUS_INSUFFICIENT_RESOURCES)
    {
      EATTC_Context.DtFlowStatus = EATTC_APP_FLOW_OFF;
      (Notification_Data_Buffer2[0])-=1;
    }
    else
    {
      UTIL_SEQ_SetTask(1U << CFG_TASK_BLE_HOST, CFG_SEQ_PRIO_0);
      UTIL_SEQ_SetTask(1U << CFG_TASK_WRITE_DATA_BEARER2_ID, CFG_SEQ_PRIO_0);
    }
  }
  BleStackCB_Process();

  return;
}

static void Resume_Write1(void)
{
  EATTC_Context.DtFlowStatus = EATTC_APP_FLOW_ON;
  UTIL_SEQ_SetTask(1U << CFG_TASK_WRITE_DATA_BEARER1_ID, CFG_SEQ_PRIO_0);
}

static void Resume_Write2(void)
{
  EATTC_Context.DtFlowStatus = EATTC_APP_FLOW_ON;
  UTIL_SEQ_SetTask(1U << CFG_TASK_WRITE_DATA_BEARER2_ID, CFG_SEQ_PRIO_0);
}


static void DataThroughputNotif_Bearer1_proc(void *arg)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_DATA_FROM_SERVER_BEARER1_ID, CFG_SEQ_PRIO_0);
}
                       
static void DataThroughputNotif_Bearer2_proc(void *arg)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_DATA_FROM_SERVER_BEARER2_ID, CFG_SEQ_PRIO_0);
}                       
                       

static void DataT_Notification_Data_Bearer1( void )
{
  DataThroughputValue1 = (uint32_t)(DataTransfered1 / TIMEUNIT);
  packet_lost_local = (uint32_t)(packet_lost / TIMEUNIT);
  DataTransfered1 = 0;
  packet_lost = 0;

  LOG_INFO_APP("  DataThroughput1 = %ld bytes/s lost = %ld \n",DataThroughputValue1, packet_lost_local);
  return;
}
                       
static void DataT_Notification_Data_Bearer2( void )
{
  DataThroughputValue2 = (uint32_t)(DataTransfered2 / TIMEUNIT);
  packet_lost_local = (uint32_t)(packet_lost / TIMEUNIT);
  DataTransfered2 = 0;
  packet_lost = 0;

  LOG_INFO_APP("  DataThroughput2 = %ld bytes/s lost = %ld \n",DataThroughputValue2, packet_lost_local);
  return;
}                       

#if defined(__GNUC__) && !defined (__clang__)
uint8_t __attribute__((optimize("Os"))) APP_BLE_ComputeCRC8( uint8_t *DataPtr , uint8_t Datalen )
#else
uint8_t APP_BLE_ComputeCRC8( uint8_t *DataPtr , uint8_t Datalen )
#endif
{
  uint8_t i, j;
  const uint8_t PolynomeCRC = 0x97;
  uint8_t CRC8 = 0x00;

  for (i = 0; i < Datalen; i++)
  {
    CRC8 ^= DataPtr[i];
    for (j = 0; j < 8; j++)
    {
      if ((CRC8 & 0x80) != 0)
      {
        CRC8 = (uint8_t) ((CRC8 << 1) ^ PolynomeCRC);
      }
      else
      {
        CRC8 <<= 1;
      }
    }
  }
  return (CRC8);
}

#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  if (BleCoC_EATTContextCentral.connectionstatus != APP_BLE_CONNECTED_CLIENT)
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_START_SCAN_ID, CFG_SEQ_PRIO_0);
  }
  else
  {
    if(EATTC_Context.ButtonTransferReq != EATTC_APP_TRANSFER_REQ_OFF)
    {
      BSP_LED_Off(LED_BLUE);
      EATTC_Context.ButtonTransferReq = EATTC_APP_TRANSFER_REQ_OFF;
    }
    else
    {
      BSP_LED_On(LED_BLUE);
      EATTC_Context.ButtonTransferReq = EATTC_APP_TRANSFER_REQ_ON;
      UTIL_SEQ_SetTask(1U << CFG_TASK_WRITE_DATA_BEARER1_ID, CFG_SEQ_PRIO_0);
    }
  }
  BleStackCB_Process();
  return;
}
void APPE_Button2Action(void)
{
  tBleStatus status;
  if (BleCoC_EATTContextCentral.connectionstatus != APP_BLE_CONNECTED_CLIENT)
  {
    status = aci_gap_clear_security_db();
    if (status != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("Clear security DB cmd failure: 0x%02X\n", status);
    }
    else
    {
      LOG_INFO_APP("Clear security DB cmd success\n");
    }
  }
  else
  {

  }
  return;
}

void APPE_Button3Action(void)
{

  return;
}
#endif
/* USER CODE END LF */
